results/test_maximum_write_throughput/fio-100g-3.log
Starting FIO benchmark on pod 3...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randwrite
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=76: Tue Mar 17 10:48:33 2026
  write: IOPS=257, BW=258MiB/s (271MB/s)(151GiB/600205msec); 0 zone resets
    slat (usec): min=46, max=933, avg=182.85, stdev=29.14
    clat (msec): min=3, max=1424, avg=495.77, stdev=203.60
     lat (msec): min=3, max=1424, avg=495.95, stdev=203.60
    clat percentiles (msec):
     |  1.00th=[   35],  5.00th=[  127], 10.00th=[  234], 20.00th=[  338],
     | 30.00th=[  401], 40.00th=[  447], 50.00th=[  493], 60.00th=[  542],
     | 70.00th=[  592], 80.00th=[  659], 90.00th=[  760], 95.00th=[  844],
     | 99.00th=[  986], 99.50th=[ 1036], 99.90th=[ 1150], 99.95th=[ 1183],
     | 99.99th=[ 1267]
   bw (  KiB/s): min=112640, max=735482, per=99.94%, avg=264137.83, stdev=6916.36, samples=9593
   iops        : min=  110, max=  718, avg=257.93, stdev= 6.75, samples=9593
  lat (msec)   : 4=0.01%, 10=0.07%, 20=0.23%, 50=1.48%, 100=2.19%
  lat (msec)   : 250=7.06%, 500=40.34%, 750=38.21%, 1000=9.62%, 2000=0.87%
  cpu          : usr=0.63%, sys=0.62%, ctx=149618, majf=0, minf=313
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,154786,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=258MiB/s (271MB/s), 258MiB/s-258MiB/s (271MB/s-271MB/s), io=151GiB (162GB), run=600205-600205msec
FIO benchmark completed on pod 3