results/test_maximum_write_throughput/fio-10g-0.log
Starting FIO benchmark on pod 0...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
#invalidate=1
size=10G
runtime=600
ramp_time=120
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[simple]
#rw=randrw
rw=randwrite
#rwmixread=70
bs=1m
---
simple: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 8 processes
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
simple: Laying out IO file (1 file / 10240MiB)
[...]

simple: (groupid=0, jobs=8): err= 0: pid=60: Tue Mar 17 10:48:25 2026
  write: IOPS=283, BW=284MiB/s (298MB/s)(167GiB/600570msec); 0 zone resets
    slat (usec): min=83, max=1239, avg=216.44, stdev=44.80
    clat (msec): min=3, max=1137, avg=450.37, stdev=164.19
     lat (msec): min=3, max=1137, avg=450.59, stdev=164.18
    clat percentiles (msec):
     |  1.00th=[   30],  5.00th=[  107], 10.00th=[  228], 20.00th=[  334],
     | 30.00th=[  388], 40.00th=[  430], 50.00th=[  464], 60.00th=[  502],
     | 70.00th=[  542], 80.00th=[  584], 90.00th=[  642], 95.00th=[  693],
     | 99.00th=[  793], 99.50th=[  827], 99.90th=[  902], 99.95th=[  936],
     | 99.99th=[  995]
   bw (  KiB/s): min=92139, max=468992, per=100.00%, avg=290950.52, stdev=6433.79, samples=9599
   iops        : min=   89, max=  458, avg=284.09, stdev= 6.28, samples=9599
  lat (msec)   : 4=0.01%, 10=0.10%, 20=0.27%, 50=1.98%, 100=2.41%
  lat (msec)   : 250=6.52%, 500=48.64%, 750=38.14%, 1000=2.00%, 2000=0.01%
  cpu          : usr=0.78%, sys=0.80%, ctx=163785, majf=0, minf=12384
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,170426,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=284MiB/s (298MB/s), 284MiB/s-284MiB/s (298MB/s-298MB/s), io=167GiB (179GB), run=600570-600570msec
FIO benchmark completed on pod 0